export const validInputDates = ["0", "1", "31", "32", "-1", "-31"];

export const invalidInputDates = [
  "-0",
  "2.5",
  "foo",
  "bar",
  "😊",
  "12.0",
  "12.000000000000004",
  "12345678910987654321",
];

export const validDomainDates = [1, 2, 11, 15, 23, 31];

export const invalidDomainDates = [32, 0];

export const validInputMenus = [
  "-1",
  "티본스테이크-1",
  "양송이수프-1,티본스테이크-0",
  "티본스테이크-30",
  "레드와인-1",
  "레드와인-1,블루와인-1,퍼플와인-1,그린와인-1",
  "foo-1",
];

export const invalidInputMenus = [
  "티본스테이크1",
  "양송이수프-1,티본-스테이크-1",
  "시저샐러드-1,티본스테이크--1",
  "티본스테이크-foo",
  "티본스테이크-1.0",
  "티본스테이크-1,티본스테이크-1",
  "티본스테이크-1.000000000000004",
  "티본스테이크-1.시저샐러드-1",
  "티본스테이크-1시저샐러드-1",
  "티본스테이크-1,,시저샐러드-1",
  "티본스테이크-1,-,시저샐러드-1",
];

export const valiidDomainMenus = [
  [["티본스테이크-1"]],
  [
    [
      "양송이수프-3",
      "타파스-2",
      "시저샐러드-3",
      "티본스테이크-1",
      "해산물파스타-2",
      "아이스크림-3",
      "제로콜라-6",
    ],
  ],
];

export const invalidDomainMenus = [
  [["-1"]],
  [["티본스테이크-1", "-1", "시저샐러드-1"]],
  [["foo-1"]],
  [["티본스태이크-1"]],
  [["티본스테이크-0"]],
  [["샴페인-1", "제로콜라-2", "레드와인-1"]],
  [["제로콜라-15"]],
  [["티본스테이크-10", "타파스-10", "해산물파스타-1"]],
  [
    [
      "양송이수프-3",
      "타파스-2",
      "시저샐러드-5",
      "티본스테이크-3",
      "해산물파스타-2",
      "아이스크림-5",
      "제로콜라-1",
    ],
  ],
];
